Revit 2026 API
AnalyticalSurfaceBase.SetOuterContour Method
 Sets the Curve Loop that defines the geometry of the Analytical Surface element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void SetOuterContour(
	CurveLoop outerContour
)
Public Sub SetOuterContour (
	outerContour As CurveLoop
)
public:
void SetOuterContour(
	CurveLoop^ outerContour
)
member SetOuterContour :
        outerContour : CurveLoop -> unit
Parameters
outerContour CurveLoop
 New Curve Loop for the Analytical Surface element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Curve Loop must be planar and not self-intersecting.
See Also
Reference
AnalyticalSurfaceBase Class
Autodesk.Revit.DB.Structure Namespace